
# Taps
tap "azure/functions"
tap "caskroom/cask"
tap "cloudfoundry/tap"
tap "homebrew/cask-fonts"
tap "isen-ng/dotnet-sdk-versions"
tap "microsoft/azdata-cli-release"
tap "microsoft/mssql-release"

# Casks
cask "azure-data-studio"
cask "db-browser-for-sqlite"
cask "docker"
cask "dotnet-sdk"
#cask "dropbox"
cask "iterm2"
cask "font-fontawesome"
#cask "firefox"
cask "gimp"
#cask "google-chrome"
cask "keepassx"
cask "keepassxc"
cask "microsoft-azure-storage-explorer"
cask "minikube"
cask "postman"
cask "powershell"
cask "visual-studio"
cask "visual-studio-code"

# Packages
brew "ansible"
#brew "awscli"
brew "azdata-cli"
brew "azure-cli"
brew "azure-functions-core-tools"
brew "bash" # macOS bash version is outdated
brew "coreutils"
brew "dos2unix"
brew "draft"
brew "findutils"
brew "git"
brew "hub"
brew "jq"
brew "kubernetes-cli"
brew "kubernetes-helm"
brew "msodbcsql"
brew "mssql-tools"
brew "openssl"
brew "pulumi"
brew "python"
brew "sqlite"
brew "telnet"
brew "terraform"
brew "tfenv"
brew "tflint"
brew "typescript"
brew "vsts-cli"
brew "wget"
brew "zsh"
