
# Taps
tap "azure/bicep", "https://github.com/azure/bicep"
tap "azure/functions"
tap "caskroom/cask"
tap "cloudfoundry/tap"
tap "github/gh"
tap "hashicorp/tap"
tap "homebrew/cask-fonts"
tap "isen-ng/dotnet-sdk-versions"
tap "microsoft/azdata-cli-release"
tap "microsoft/mssql-release"
tap "z80oolong/tmux"

# Casks
cask "azure-data-studio"
cask "db-browser-for-sqlite"
cask "docker"
cask "dotnet-sdk"
#cask "dropbox"
cask "iterm2"
cask "font-fontawesome"
#cask "firefox"
cask "font-source-code-pro-for-powerline"
cask "font-hack-nerd-font"
cask "gimp"
#cask "google-chrome"
cask "keepassx"
cask "keepassxc"
cask "microsoft-azure-storage-explorer"
cask "microsoft-edge"
cask "minikube"
#cask "mono-mdk" # Required for Xamarin -> Visual Studio
cask "mono-mdk-for-visual-studio"
cask "postman"
cask "powershell"
cask "unity"
cask "unity-hub"
cask "visual-studio"
cask "visual-studio-code"
cask "vlc"

# Packages
brew "ansible"
#brew "awscli"
brew "azcopy"
#brew "azdata-cli"
brew "azure-cli"
brew "azure-functions-core-tools"
brew "azure-functions-core-tools@3"
brew "azure/bicep/bicep"
brew "bash" # macOS bash version is outdated
brew "coreutils"
brew "dos2unix"
brew "draft"
brew "findutils"
brew "gh"
brew "git"
brew "jq"
brew "kubernetes-cli"
brew "kubernetes-helm"
#brew "msodbcsql"
#brew "mssql-tools"
brew "nmap"
brew "openssl"
brew "pulumi"
brew "python"
brew "ruby"
brew "sqlite"
brew "telnet"
#brew "hashicorp/tap/terraform"
brew "tfenv"
brew "tflint"
brew "tmux@2.3"
brew "typescript"
brew "util-linux"
brew "vsts-cli"
brew "wget"
brew "zsh"
