# Taps
tap "azure/functions"
tap "azure/kubelogin"
tap "cloudfoundry/tap"
tap "github/gh"
tap "hashicorp/tap"
tap "isen-ng/dotnet-sdk-versions"
tap "microsoft/azdata-cli-release"
tap "microsoft/git"
tap "microsoft/mssql-release"
tap "z80oolong/tmux"

# Packages required by other packages
brew "gcc"
brew "svn"

# Casks
cask "azure-data-studio"
cask "cameracontroller"
cask "db-browser-for-sqlite"
cask "beyond-compare"
cask "copilot-cli"
# cask "docker"
cask "dotnet-sdk"
#cask "dropbox"
cask "iina"
cask "iterm2"
cask "font-fontawesome"
# cask "finicky"
#cask "firefox"
cask "font-source-code-pro-for-powerline"
cask "font-hack-nerd-font"
cask "gimp"
cask "git-credential-manager-core"
cask "github"
#cask "google-chrome"
cask "keepassx"
cask "keepassxc"
# cask "launchcontrol"
cask "logi-options-plus"
cask "microsoft-azure-storage-explorer"
cask "microsoft-edge"
cask "minecraft"
# cask "minikube"
#cask "mono-mdk" # Required for Xamarin -> Visual Studio
cask "mono-mdk-for-visual-studio"
cask "multimc"
cask "owasp-zap"
cask "podman-desktop"
cask "postman"
cask "powershell"
cask "raindropio"
cask "raycast"
cask "rsyncosx"
cask "shottr"
cask "slack"
# cask "unity"
# cask "unity-hub"
cask "visual-studio"
cask "visual-studio-code"
cask "vlc"
#cask "zoom"

# Packages
brew "ansible"
#brew "awscli"
brew "azcopy"
#brew "azdata-cli"
brew "azure-cli"
# brew "azure-functions-core-tools"
# brew "bicep"
brew "bash" # macOS bash version is outdated
brew "coreutils"
brew "defaultbrowser"
brew "dos2unix"
# brew "draft"
brew "findutils"
brew "gh"
brew "git"
brew "helm"
brew "jq"
brew "kubelogin"
brew "kubernetes-cli"
#brew "msodbcsql"
#brew "mssql-tools"
brew "nmap"
brew "openjdk"
brew "openssl"
brew "hashicorp/tap/packer"
brew "pandoc"
brew "podman"
brew "pulumi"
brew "python"
brew "rsync"
brew "ruby"
brew "sqlite"
brew "telnet"
brew "hashicorp/tap/terraform"
# brew "tfenv"
brew "tflint"
brew "tmux"
brew "typescript"
brew "util-linux"
brew "wget"
brew "zsh"
