apt-transport-https
ca-certificates
curl
gnupg
lsb-release
wget
ansible
azure-cli
azure-functions-core-tools
blobfuse
coreutils
docker
dos2unix
dotnet-sdk-3.1
findutils
fuse
git
jq
kubectl
msodbcsql17
mssql-cli
mssql-tools
nano
nmap
node-typescript
powershell
snapd
telnet
unzip
whois